------------------------------------------------color table -------------------------------------------------
-------------------------主界面--------------------------------------
探索灯笼 = {0xffffec,"-7|-25|0x6a4f19,5|-5|0xffffcf,-16|-4|0xfffffd",95,434,289,505,373}
--组队 = {0x8f5ea0,"-45|-4|0xbdb5a4,-38|45|0xf8f3e0,59|17|0x603d3a", 85, 434,1413, 438, 1417} --主界面的组队按钮
组队 = {0xf2f0ee,"0|31|0xe0dddb,3|55|0xd1c9c6,-46|51|0x66369c,51|49|0x6f35af,2|-33|0xd86747",90,348,1320,481,1464}
悬赏  = {0xefe2b9,"-2|14|0xe9d59a,-1|36|0xdbc26d,40|6|0xeddca7,51|39|0xd14c47,22|29|0xe5cd7b,31|39|0xb63c3a,33|62|0xe9d6b8,10|-32|0x1d1517,22|-8|0x7b76d4",90,1664,551,2042,930}
--主界面卷轴 = {0xda5b39,"-10|10|0x521611,-19|26|0x361b0c,23|-48|0xd9cbc4,38|-86|0x86221f,64|-114|0xd9cbc4,85|-143|0xc8a172,92|-162|0x9d6847,1|-15|0xa5704c", 90, 1739, 1259, 2045, 1538}
主界面卷轴 = {0xe8c184,"-13|22|0x731f25,-28|38|0xe0d0cb,-38|59|0xb43e3f,-48|73|0x9b3336,-68|101|0xdac8c4,-83|130|0xd4b282,-105|159|0xc04242,-124|186|0x4e2c1a",90,1812,1258,2047,1537}
町中 = {0x8f8c8c,"0|-13|0x928e8c,-4|-40|0x949292,-4|-62|0x9b949a,-4|-82|0x9c999b,-3|-109|0x9b9997,0|-141|0x9c9699,1|-168|0x9a9895,1|-189|0x999795,-2|-218|0x9b9897",90,1532,716,1555,906}

-----------------------------------------------------------------------------------------------
-- 是否处于组队界面
组队界面 = {0x8d7245,"-10|75|0x7d1b1e,4|65|0xe6cc96,1012|656|0xf3b25e,1573|682|0xf3b25e,1772|-119|0x783a47,1765|1|0x8d7245,1765|67|0xedd9a1,1517|641|0x2c2821,-28|-134|0xe3c66b",90,46,371,233,771}
-- 组队界面妖气封印黑字
妖气封印1 = {0x312d29,"0|6|0x37332d,-1|11|0x332f2a,-1|18|0x272420,20|8|0x2c2924,19|-2|0x2f2b26,12|17|0x534c44,40|11|0x4d4740,72|9|0x3f3a34,33|22|0xe8d6c1",90,208,483,601,1319}
妖气封印 = {0xf4efdc,"-2|11|0xf6f1de,11|15|0xd2ccba,17|5|0x420a0a,30|-12|0xf7f2df,46|-2|0xf7f2df,48|13|0xf0ebd8,36|12|0x470b0b,55|7|0x5a0909,-19|4|0xf8f3e0",90,631,459,873,538}
-- 组队界面的刷新按钮
组队刷新 = {0xf3b25e,"-45|-33|0x953a2e,-45|45|0x983d2e,216|44|0x983d2e,218|-31|0x983c2e,162|7|0xf3b25e,61|-10|0x272420,56|-9|0xf3b25e,49|-8|0x413628,56|-4|0x483b2a",90,1064,1242,1369,1364}
组队开始 = {0xf3b25e,"-1101|0|0xdf6851",90,1420,1105,1714,1208}
组队等待 = {0xc7bdb4,"-1088|-14|0xdf6851",90,1425,1099,1706,1209}
--
刷新等待 = {0xffffff,"10|-1|0xffffff,1|4|0xffffff",95,1207,779,1254,824}


离开队伍 = {0xdf6851,"2|4|0xdf6851,1|97|0x211a19,31|-876|0x493625,29|-869|0x493625",95,243,1138,269,1171}
队长等待 = {0xb0a9a1,"2|30|0xb0a9a1,6|53|0xb0a9a1,-1267|-7|0xdf6851",95,1629,1124,1759,1182}
可以开始 = {0xf3b25e,"45|59|0xf3b25e,-1218|10|0xdf6851,-1044|34|0xc7bdb4,-909|50|0xc7bdb4",95,1564,1116,1782,1191}
创建队伍 = {0xf3b25e,"-759|-6|0xdf6851,-395|-748|0x6b4837,-395|-721|0xbda78d,-444|212|0x524e4a",90,1288,1048,1523,1176}
二人满 = {0xe9d99b,"32|6|0x491c0c,56|11|0x403122,48|57|0x431607,2|36|0x2c251a",95,1094,918,1196,1008}			--第二个位置的邀请
三人满 = {0xe9d99b,"32|6|0x491c0c,56|11|0x403122,48|57|0x431607,2|36|0x2c251a",95,1594,875,1774,1039}			--第三个位置的邀请


创建 = {0xf3b25e,"18|2|0xf3b25e,45|4|0xf3b25e,83|7|0x51412c,127|8|0xf3b25e",95,1325,1105,1485,1171}
六十底 = {0x030202,"-9|10|0x020101,-8|14|0x010100,-7|27|0x2a231c,4|26|0x0f0d0a,6|16|0x070604,3|12|0x060504,-1|16|0xa88e71,-1|19|0xa88e71,-1|22|0xa88e71",95,1294,688,1322,732}
六十顶 = {0x030202,"-9|10|0x020101,-8|14|0x010100,-7|27|0x2a231c,4|26|0x0f0d0a,6|16|0x070604,3|12|0x060504,-1|16|0xa88e71,-1|19|0xa88e71,-1|22|0xa88e71",95,1452,683,1486,730}
觉醒位置 = {{409,649},{400,763},{401,894},{392,1007}}

------------------------------------------------------------------------------------------------------------------------------------------------------------
顶点退出 = {0xeef4fb,"-40|2|0x1f0f3c,59|3|0x1a3769,15|-22|0xf0f5fb,11|16|0xe2edf9",90,21,25,162,164}
右上红叉 = {0x6b333c,"-21|19|0x74363a,4|36|0x753642,21|16|0x763255,-1|17|0xe8d4cf",90,1354,28,2045,666}
聊天红叉 = {0xe9d7d1,"-22|-5|0x75393d,37|0|0x682b42,6|-25|0x69353e,6|27|0x70313c",90,786,0,926,145}
延迟白点 = {0xffffff,"4|-1|0xfffff6",95,1005,745,1051,790}
达摩1 = {0xd68f1b,"12|-4|0xb12118,23|-16|0xcb8a1f,31|-21|0xa92418,36|-26|0xc58420",90,1125,781,1193,829}
达摩2 = {0x000000,"-39|13|0x000000,33|-6|0x000000,-6|75|0x62090b",90,950,1078,1090,1163}


业原火 = {0xf2faf9,"-2|-31|0x110c10,34|19|0x116654,-62|27|0xb93729",90,1360,691,1498,821}
业原火挑战 = {0xf3b25e,"-289|-273|0xf2faf9,-274|-306|0xf9cc51,-294|-303|0x130e12,-238|-250|0x259c82,-125|-242|0x1a171f",90,1136,515,1601,1037}


结界点击 = {0xb70138,"-3|-46|0x211413,-63|32|0x251716,62|30|0x281918,-5|27|0xe0bb88",95,1496,1145,1589,1235}
不动风车 = {0x425086,"39|12|0x4e5f92,52|38|0x51669a,13|85|0x42342d,-21|55|0x3e2a21",90,1821,522,1959,643}
式神育成 = {0x0b0804,"2|5|0x0b0803,10|23|0x0b0800,18|28|0x0b0800,19|23|0x0a0800",95,1041,677,1093,874}
第一灯笼 = {0x525252,"-4|36|0xf7cd83,35|9|0x262626,-36|9|0x202020",95,118,409,230,473}
好友寄养 = {0x6b4837,"4|27|0xbca68c,8|43|0x9e876c,-4|54|0xd4cebd,11|98|0xcbb59c",95,1033,519,1089,539}
好友结界 = {0x513930,"15|-24|0x513930,18|28|0x533930,317|586|0x0b0703,320|595|0x0b0802",90,712,16,755,98}
结界卡 = {0xede7d5,"-2|18|0xf8f3e0,-3|38|0xf8f3e0,6|9|0xf8f3e0,17|10|0xf8f3e0,-33|10|0x634f3d,-13|-20|0x4f181e,4|69|0xdde2df",93,886,235,1010,333}

探索地图 = {0x2c1d5a,"-21|15|0x5335d7,22|12|0x1f2a8b,-18|89|0x453de1,11|92|0x1e1ea3,56|50|0x1a3da1,-52|42|0x341582",93,300,1395,358,1429}
地图宝箱 = {0x44252a,"-18|6|0x532929,0|8|0x48262a,-4|16|0xdd5218,-4|33|0xb73a1a,-4|43|0xb23519,-4|56|0x9c2015,-4|65|0x9c2115,-4|72|0xe3b339,-1|81|0xd89316",90,599,368,1613,1206}
副本里面 = {0x32254a,"-106|24|0x3d2e5a,-231|17|0x2a3b2e,-312|-7|0x625b77,-291|-159|0x5c2135,-285|-170|0x872f4f",93,300,1443,464,1493}
确认退出 = {0xf3b25e,"-65|-29|0x91362e,-65|29|0x95392e,179|27|0xc87a47,177|-25|0x9b4130,22|-8|0x302a23",95,1108,799,1375,880}
经验怪 = {0x337c88,"5|35|0x8b1a18,15|76|0xa56646,-25|21|0xae8d67",90,0,0,2047,1535}
金币怪 = {0xeed829,"27|-16|0xfcd702,-2|-22|0xc7a450,-2|-38|0xd1c474,-5|-52|0x5c3a1f",95,0,0,1535,2047}
御魂怪 = {0xeec20a,"-21|-13|0xed8e16,-26|-29|0x940e0e,-28|-46|0xe7decb,-15|-44|0x070d0c",95,0,0,1535,2047}
晴明 = {0x90d1e6,"11|-52|0x628fca",95,971,1131,1143,1282}
神乐 = {0xddaf79,"-10|91|0xeeeee1",95,722,1108,855,1203}
博雅 = {0x3fa2b0,"0|-28|0x5f595b",95,652,1093,878,1294}
比丘尼 = {0x1f78db,"0|4|0x1f76d4",95,729,1109,745,1126}
交替 = {0xffffff,"13|-17|0x57429c,-2|20|0xffffff,13|44|0x3931a2",95,64,1417,143,1472}
更换阴阳师 = {0xffffff,"25|-12|0x2e95e8,-2|35|0xffffff,23|54|0xffffff,43|60|0x3097e9,50|21|0xffffff,83|-10|0xffffff,56|44|0xffffff,68|80|0xffffff,93|95|0xffffff",95,180,715,1866,960}

邮箱体力 = {0xe96f2a,"9|5|0xe83d26,15|7|0xed642d,26|12|0xff9932,32|17|0xf96529,42|22|0xe14226,-11|-20|0x5e4664,51|-18|0x5e4563,63|10|0x5e4563,-12|49|0x604865",95,882,838,1707,1091}
邮件位置 = {{572,459},{546,654},{536,862},{538,1051}}


-----------------------------------------------------------------------------------------------------------------------------------------------------------------
天狗死亡 = {0x29402b,"2|0|0x293f2b,5|0|0x29452e,5|3|0x29462d,13|4|0x26462c,10|9|0x2a472e,58|84|0x333b32",95,380,334,400,364}
觉血条 = {0xb92118,"-38|16|0x372215,-38|-14|0x362316",95,965,269,988,283}
新回合 = {0x272420,"0|13|0xe6cca0,2|-15|0x272420", 95, 1027-2,794-2,1027+2,794+2}
二口女标记 = {0xf9936a,"-2|-4|0xfb826a,7|-4|0xfe8966,-10|-4|0xff9863", 95, 439,313,677,516}
右边天狗 = {0xb61b16,"-44|-14|0x362216,-44|18|0x372215",95,1457,280,1558,416}


-----------------------------------------------------------------------------------------------------------------------------------------------------------
快进 = {0xf7f2df,"0|-15|0x5733ce,23|-15|0x533dc8,46|-15|0x3b38b0,32|15|0x393026,30|34|0xf7f2e0,14|41|0x5846e3",95,1764,291,1919,375}
对话 = {0x12100c,"1|66|0x15110d,-56|43|0x614e3b,61|37|0x5c412b,2|40|0xfde8e8",93,0,0,2047,1535}
战斗图标 = {0xf8f9ff,"18|16|0x343b6b,-19|14|0xe2e4fc,4|40|0x3e2215,-4|-44|0xf1acb6", 95, 0, 0, 1535, 2047}
声优 = {0xfbfbfb,"-12|9|0xffffff,-10|26|0xffffff,4|19|0xffffff,4|14|0x0a090c,28|1|0xffffff,21|28|0xffffff,16|11|0xffffff,26|12|0xffffff,29|2|0xffffff",93,1685,1418,1757,1464}
----------------------------------------------------------------------------------------------------------------------------------------------------
准备 = {0xfffffa,"5|-39|0xfffff9,27|-34|0xfff3d1,27|-1|0xfffaeb,51|-17|0xfff2d0", 90, 1789, 1274, 1798, 1283}
准备还有鼓 = {0xf1d6a4,"31|4|0xe9c283,82|3|0xe8c080,129|0|0xe8bc7a,158|-1|0xe8be7d",95,1786,1309,1977,1387}
准备完成 = {0xc8955e,"18|-8|0xe6c790,47|-6|0xe6c68e",95,1832,1442,1910,1490}
--战斗胜利 = {0x6f160e,"0|34|0xb9ac9a,-28|39|0x7f170f,33|43|0x7f170f",90,733,266,807,318}
--战斗胜利 = {0xccbba6,"-45|12|0x931b11,42|19|0x961b11,8|66|0xd8cab4,-81|77|0xd9cbb5,73|79|0xd1c1a7,-76|117|0x9c805f,-56|162|0xd73324,131|110|0xa88e95,165|36|0xa68c5b",92,689,243,870,383}
战斗标记 = {0xf9936a,"-2|-4|0xfb826a,7|-4|0xfe8966,-10|-4|0xff9863", 95, 305,33,1761,730}
战斗胜利 = {0xccbba6,"-45|12|0x931b11,42|19|0x961b11,8|66|0xd8cab4,-81|77|0xd9cbb5,73|79|0xd1c1a7,-76|117|0x9c805f,-56|162|0xd73324",90,689,243,870,383}
战斗失败 = {0x5c5266,"21|-70|0x50495a,82|0|0x595063,37|-11|0xb7a58f,42|31|0xc1ae94,62|77|0xbba689,28|109|0x6c5638,27|146|0x201d25,-54|32|0xbca78a,-5|28|0x230a07", 90, 583, 159, 980, 508}
---------------------------------------------------------------------------------------------------------------------------------------------------------
式神界面 = {0xaf8c56,"10|0|0xaf8c56,20|-3|0xaf8c56,25|-7|0x7e5e38,11|-14|0x87683e,13|0|0xaf8c56,18|14|0xaf8c56,27|29|0xa98652,37|37|0xaf8c56,27|9|0x401b0d",95,228,15,280,87}
召唤碎片界面 = {0xeaeaea,"-3|25|0xf2f2f2,-19|73|0xf3f3f3,-14|72|0xf3f3f3",95,62,1202,117,1244}
送心 = {0xeb8649,"-37|4|0xf18a5d,-39|-10|0xfaf5ca,-43|20|0xfaf2e5,-27|20|0xfdfbf0",80,620,397,811,1084}
收心 = {0xf5c95c,"-35|6|0xffba00,-40|-10|0xfff6ad,-21|18|0xf6ffdd,-12|-25|0xa65a3e",80,620,397,811,1084}
聊天发送 = {0xf3b25e,"19|0|0xf3b25e,116|4|0xf3b25e,160|9|0xf3b25e,-24|-35|0x963b2e,168|43|0x9a3f2e,-91|-2|0xf9f4ec,-584|-7|0xee905d",90,603,-1,895,1533}


------------------------------------------------主界面功能区-------------------------------------------------
sub_function = switch{
  ['collection'] = function() tap(189, 1395) mSleep(1000) end,
  ['party'] = function() tap(400, 1395) mSleep(1000) end,
  ['guild'] = function() tap(633, 1395) mSleep(1000) end,
  ['shop'] = function() tap(888, 1395) mSleep(1000) end,
  ['quest'] = function() tap(1091, 1395) mSleep(1000) end,
  ['friend'] = function() tap(1328, 1395) mSleep(1000) end,
  ['spell'] = function() tap(1560, 1395) mSleep(1000) end,
  ['ss'] = function() tap(1762, 1395) mSleep(1000) end
}


------------------------------------------------妖气封印-------------------------------------------------
yqfy_ocr_table = {{849,574,1050,629}, {849,740,1050,792}, {851,898,1041,954}, {852,1059,1049,1116}}
海坊主 = {0x3c3933,"1|5|0x302d28,0|13|0x4d4a43,7|9|0xf8f3e0,17|-3|0x35322d,13|1|0xf7f2df,20|8|0xf8f3e0,16|18|0xf8f3e0,16|20|0xf8f3e0,20|25|0x272420",90}
经验 = {0x69655c,"-5|10|0x2d2a26,3|9|0x44413a,-6|14|0xf8f3e0,7|20|0xede8d6,20|4|0x625f57,17|18|0x423f39,22|22|0xf8f3e0,46|0|0x47443e,48|16|0x393631",90}
--二口女 = {0x46433d,"-1|6|0xf2e9d4,-1|10|0xdfcdb3,-1|18|0x47443e,34|9|0x47443e,43|10|0xdcb983,55|5|0x272420,73|-1|0xdfcdb3,86|-4|0x4b4841,89|19|0x2a2723",90}
二口女 = {0x292622,"1|7|0x43403a,1|14|0x3b3732,11|13|0x36332e,18|13|0x282521,19|6|0x282521,20|1|0x2e2b27,19|-3|0x322f2a,22|0|0x282521,9|6|0xdab57b",95}
小黑 = {0x504d46,"-4|11|0x2a2723,-6|19|0xf8f3e0,2|20|0xf8f3e0,-3|23|0x2f2c27,8|9|0xf0ebd9,13|8|0x35322d,16|8|0xe2ddcb,9|14|0xe3decd,13|13|0x4a4740",90}
金币 = {0x2c2925,"-5|3|0x2e2a26,-11|4|0x393630,-8|7|0xf4efdc,1|7|0xf8f3e0,-4|12|0x2c2925,-8|16|0xf8f3e0,1|17|0xf4ebd3,-4|23|0x322f2a,-4|34|0x36332e",90}
椒图 = {0x3e3b35,"-3|-2|0xede8d6,3|-4|0xdfdac9,4|3|0xf4efdc,-3|11|0xddd9c8,0|9|0x433f39,0|15|0x272420,0|-10|0x36332e,6|-7|0x646058,45|11|0x4d4943",90}
骨女 = {0x3e3b35,"3|1|0xf8f3e0,4|1|0xf8f3e0,6|1|0xf5f0dd,8|1|0x36332e,12|2|0xe4e0ce,14|4|0x656159,14|7|0xd2cdbd,13|9|0x69665d,14|11|0xd0cbbb",90}
哥哥 = {0x4b4841,"4|2|0xf8f3e0,8|-2|0x514d46,-1|14|0x35322d,2|18|0xd6d1c1,4|18|0x413e38,17|5|0x2f2c27,19|5|0xe7e2d1,22|5|0x545049,18|20|0xf7f2df",90}
饿鬼 = {0x36332e,"2|4|0xf1ecd9,6|2|0x292622,5|9|0xf6f1de,1|9|0x535049,5|14|0xf3eedb,1|20|0x37342e,13|8|0x2a2723,8|19|0xf0ebd9,13|23|0x292622",90}
------------------------------------------------突破-------------------------------------------------



all_enemy = {}
all_enemy[1] 	= {393, 480}  --+63
all_enemy[2] 	= {944, 480}
all_enemy[3] 	= {1495,480}
all_enemy[4]	= {393,695}
all_enemy[5]	= {944,695}
all_enemy[6]	= {1495,695}
all_enemy[7]	= {393,910}
all_enemy[8]	= {944,910}
all_enemy[9]	= {1495,910}


liao_enemy = {}
liao_enemy[1]	= {954, 514}  --+63
liao_enemy[2] = {1495, 514}
liao_enemy[3] = {954,730}
liao_enemy[4]	= {1495,730}
liao_enemy[5]	= {954,949}
liao_enemy[6]	= {1495,949}
liao_enemy[7]	= {954,1160}
liao_enemy[8]	= {1495,1160}

liao_select = {{0xf0f0fd,"-9|-11|0x780bea,12|4|0x740ae1",90,698,333,721,364}, 
{0xf0f0fd,"-9|-11|0x780bea,12|4|0x740ae1",90, 709,638,724,653}, 
{0xf0f0fd,"-9|-11|0x780bea,12|4|0x740ae1",90,699,928,730,961}}

liao_list = {{478, 463}, {488, 745}, {538, 1100}}
选择阴阳寮 = {0x7a624c,"15|1|0x7a624c,36|5|0x7a624c",95,441,659,497,688}

------------------------------------------------狗粮-------------------------------------------------

slot = {}
slot[1] = {1301,585,1734,900}
slot[2] = {890,585,1300,900}
slot[3] = {400,630,889,900}
slot[4] = {83,512,363,944}
slot[5] = {294,318,570,578}
slot[6] = {274,577,443,879}

ss_position = {}
ss_position[1] = {334, 739}
ss_position[2] = {1020, 739}
ss_position[3] = {1685, 739}
ss_position[4] = {477, 660}
ss_position[5] = {1360, 660}


gouliang_position = {}
gouliang_position[1] = {265,1200,464,1260}
gouliang_position[2] = {465,1200,669,1260}
gouliang_position[3] = {670,1200,871,1260}
gouliang_position[4] = {872,1200,1073,1260}
gouliang_position[5] = {1074,1200,1278,1260}
gouliang_position[6] = {1279,1200,1477,1260}
gouliang_position[7] = {1478,1200,1663,1260}









------------------------------------------------------------结界卡------------------------------------------------------------
jiejie_friend = {{610, 728}, {615, 903},{607, 1085},{607, 1229}}



寄养 = {0x12100c,"0|19|0xe2c5a1,0|30|0x2d2a25,0|38|0x272420,0|48|0x2c2925,0|60|0x2d2a25,0|77|0xc19e74,0|98|0x12100c",90,982,264,1123,405}
斗鱼 = {0x102338,"-1|2|0x102338",95,1213,761,1424,903}
太鼓 = {0xd15897,"-1|2|0xd15897",95,1213,761,1424,903}
已占用 = {0xa72e2e,"12|-21|0xab3030,25|-2|0xa82e2f,14|7|0xe2d2c1,20|30|0x9f2a2a",98,1461,812,1535,954}
出现结界卡 = {0x4e0c19,"9|-1|0x4c0c19,7|9|0x4c0c19,6|-12|0x500c19",95,1156,952,1251,1001}
进入结界 = {0xf3b25e,"8|57|0xf3b25e,-91|26|0xf3b25e,132|23|0xf3b25e",95,1181,1244,1455,1337}
可放置式神 = {0x272420,"11|6|0x272420,28|-22|0xcbc4b4,34|-5|0xc5beab",95,1736,483,1869,647}

ssjiejie_position = {}
ssjiejie_position[1] = {204,1239,393,1299}
ssjiejie_position[2] = {434,1229,639,1297}
ssjiejie_position[3] = {677,1235,874,1298}
ssjiejie_position[4] = {921,1238,1110,1298}
ssjiejie_position[5] = {1158,1237,1347,1296}
ssjiejie_position[6] = {1398,1243,1584,1295}
ssjiejie_position[7] = {1636,1243,1825,1299}



------------------------------------------------业原火难度-------------------------------------------------
choose_yeyuanhuo = switch{
  [1] = function() tap(660, 480) end,
  [2] = function() tap(660, 638) end,
  [3] = function() tap(660, 786) end
}


------------------------------------------------悬赏-------------------------------------------------
xuanshang_t_table = {{488,887,595,938}, {988,889,1060,934}, {1455,886,1554,937}}
xuanshang_ss_table = {{346,414,745,797}, {828,413,1230,798}, {1309,413,1711,799}}
mystery_table = {{"兵俑", "第三章", "兵勇12*1"},
  {"丑时之女", "第十章", "丑女1*1 丑女2*2 御魂5层*1 御魂7层*1"},
  {"大天狗", "第十五章", "提灯3*1 御魂4层*1 御魂10层*2"},
  {"独眼小僧", "第十一章", "武士之灵2*3 独眼小僧12*2"},
  {"骨女", "妖气封印", "骨女*3"},
  {"鬼使白", "御魂4层", "*1"},
  {"鬼使黑", "妖气封印", "鬼使黑*3"},
  {"海坊主", "妖气封印", "海坊主*3"},
  {"河童", "第七章", "河童12*1"},
  {"蝴蝶精", "第六章", "蝴蝶精12*1或者御魂8层*1"},
  {"椒图", "妖气封印", "椒图*3"},
  {"傀儡师", "第十章", "丑时之女12*1, 傀儡师12*1"},
  {"鲤鱼精", "第七章", "鲤鱼精1*3 鲤鱼精2*1 河童1*1 提灯小僧3*2"},
  {"镰鼬", "御魂5层", "*1"},
  {"孟婆", "御魂5层", "*2"},
  {"青蛙瓷器", "御魂3层", "*1"},
  {"犬神", "御魂4层", "*1"},
  {"三尾狐", "第十八章", "三尾狐123*2 记得难度选简单"},
  {"山童", "第十六章", "饿鬼123*2"},
  {"食梦貘", "御魂4层", "*2"},
  {"桃花妖", "御魂3层", "*1"},
  {"天邪鬼赤", "第十三章", "饿鬼123*3"},
  {"天邪鬼黄", "妖气封印", "海坊主*3"},
  {"天邪鬼青", "妖气封印", "二口女*3 跳跳哥哥*3"},
  {"跳跳哥哥", "妖气封印", "跳跳哥哥*3"},
  {"童男", "第十二章", "童男12*1或御魂4层*1"},
  {"童女", "第三章", "天邪鬼黄2*3 赤舌2*2 兵俑1*2(简单难度,困难只有1个)"},
  {"涂壁", "第十四章", "涂壁12*6"},
  {"巫蛊师", "御魂6层", "*1"},
  {"吸血姬", "御魂2层", "*1"},
  {"鸦天狗", "第十二章", "海坊主2*2 童男12*2 "},
  {"阎魔", "御魂6层", "*1"},
  {"妖狐", "御魂2层", "*1"},
  {"莹草", "御魂2层, 御魂9层, 御魂10层", "*1; 业原火有好多"},
  {"雨女", "御魂6层", "*1"},
  {"座敷童子", "斗鸡,结界突破, 第十章", "傀儡师2*2, 觉2*2"}}
  
  
  
  
  
  
------------------------------------------百鬼夜行--------------------------------------
百鬼好友 = {[1] = {774, 584}, [2] = {1200, 584}, [3] = {774, 720}, [4] = {1200, 720}, [5] = {774, 856}, [6] = {1200, 856}, [7] = {774, 992}, [8] = {1200, 992}}
百鬼夜行进入界面 = {0xf3b25e,"107|-52|0x241c16,90|-31|0x973c2e",95,1438,1001,1641,1085}
百鬼夜行选择好友 = {0xcbb59c,"11|30|0xcbb59c",95,1438,1009,1479,1076}
百鬼夜行开始 = {0x874c30,"2|-15|0xfffef0,0|14|0xfbf8e3,-58|-29|0x935738,-56|-54|0x9e6045",95,1840,1349,1935,1409}
红地毯 = {0x8a1c24,"2|-31|0x871b23,7|-74|0x831a21,7|-121|0x7c1920,7|-146|0x79181f,6|-176|0x73181d,-2|-229|0x68151b",95,1704,1062,1781,1320}
百鬼中 = {0xd2b34b,"-1|15|0x593f2f,1|24|0xf8da55,-1|33|0x4f372c,1|44|0xf9da55,15|6|0x271818,31|25|0xe7d274,17|42|0x261717",95,128,1424,185,1480}
百鬼结束 = {0x272420,"-9|9|0xb8a189,6|7|0xc4af96,-2|13|0x272420,0|19|0xc1ab92",95,134,581,214,925}
鬼怪 = {0x291a28,"1|0|0x281a28,11|0|0x261b2a",95,316,1104,1760,1164}
概率up = {0x486d60,"10|0|0xf5f1de,37|0|0x2eac6e,66|-2|0x26b76e,79|-2|0x2ea86c",95,520,191,2047,725}
好友概率up = {0xe4e9d4,"21|3|0x80d2a0,51|3|0xbde3c1,72|4|0xc6dcc2,82|4|0x9cb6a2",95,520,191,2047,725}
豆子获取 = {0x825b5c,"16|0|0x8e4543,52|-1|0xe2bdac,76|-2|0x9c3e37,92|-3|0x985652",95,520,191,2047,725}
减速 = {0x384d93,"15|0|0x3857ad,32|0|0xb2bdd5,47|0|0xadb9d3,65|1|0x3e5cb0",95,520,191,2047,725}
加速 = {0x4c68b5,"25|2|0x2a53c0,46|4|0x8499ce,62|4|0x3d57a7",95,520,191,2047,725}
buff_table = {概率up, 豆子获取, 减速, 好友概率up, 加速}

百鬼式神 = {
[1] = {0xb9183b,"39|4|0xa97283,39|-8|0xab7384,40|-29|0xbd8fa1,41|-42|0xdab9c7",95,289,671,2043,1163}, --桃花 
[2] = {0x711420,"43|-2|0x4b382f,66|5|0x8f2128,84|21|0x512e2f",95,289,671,2043,1163}, --蜘蛛 
[3] = {0x291739,"-15|-13|0x5c3ca8,13|-22|0x281436,-7|-26|0x5942b5",95,289,671,2043,1163}, --鸟 
[4] = {0xfce47c,"7|-56|0xac7025,11|-111|0xcb9d48,10|-162|0xfce773",95,289,671,2043,1163}, --老头  
[5] = {0x9e655a,"34|9|0x501d2b,-10|50|0x99642c,21|57|0x9f692e",95,289,671,2043,1163}, -- 犬神 
[6] = {0x1b8797,"20|-4|0x3ccad4,37|-3|0x32dee4,49|11|0x29d6db",95,289,671,2043,1163}, --青fz 
[7] = {0x9b6eb0,"27|-10|0x423368,54|-5|0x7f5b93,64|-5|0x493972",95,289,671,2043,1163}, --判官 
[8] = {0x9c8887,"9|0|0xa18d8b,22|0|0xac9a96,40|1|0xb9adaa",95,289,671,2043,1163}, --白狼 
[9] = {0xd8cfcb,"17|-2|0xc2bdb5,49|3|0x7e693e,64|3|0xa58d56",95,289,671,2043,1163}, --小白 
[10] = {0xdbddcd,"23|1|0x1a232e,53|1|0x201d2f,76|1|0x1d1d2f",95,1133,867,1178,891}, -- 吸血 
[11] = {0xe3cbc2,"37|13|0x906e68,65|20|0x96706c,83|24|0x84615c",95,289,671,2043,1163}, --傀儡师
[12] = {0x6e66c4,"28|14|0xcbc2e7,66|18|0xb2a6db,104|30|0xc2a4d9",95,289,671,2043,1163} -- 孟婆
}
  
  
  
-------------------------------------------------------------------------斗鸡-----------------------------------------------------------
斗鸡战 = {0xe6cda3,"-20|-1|0x272420,15|-6|0x272420,-6|62|0xf2d7a4,19|121|0x771308",95,1724,1069,1851,1210}
可以使用技能 = {0xcaf3f8,"0|-21|0xcaf3f8,1|-19|0xcaf3f8,-9|-12|0xcaf3f8,5|-8|0xcaf3f8",95,1555,1359,1591,1396}

  
  
  
jokes = {'求赞一波!',
'我曾是某婚介公司主持人。一天，老板找到我：很抱歉，你被辞退了。我：为什么啊，我表现的很好啊。老板：这周已经有三个新郎的投诉，都反映你太帅了，抢了他们的风头',
'有次喂儿子吃面条，有点烫，他吐了出来，然后转头对他爸爸说：“爸爸，你快说‘老婆，这么烫的食物不要给我们儿子吃，好吗？’”提个意见而已，需要这么委婉吗？',
'本人单身男生，在出租屋打扫卫生时包租婆来收房租，对我说“小伙子还是单身吧”“你怎么知道”“干净勤快自立负责任的男孩一般都没女朋友”我竟无言以对',
'N年前，第一次去女朋友家很紧张，心里总惦记着一定要说不会抽烟、不会喝酒，进门后未来岳父拿水果给我吃，我紧张的说了两个字：“不会！”……',
'刚才拿张毛爷爷去便利店买烟，拿过烟迫不及待抽出一根点燃，接过老板找的钱顺手丢进垃圾桶，把烟外包装装进口袋，整套动作行云流水，没有一点瑕疵。旁边的老板都看呆了',
'健身房有一个教拉丁舞的漂亮小姑娘，她一来，四十岁以下的男人流口水。而她的妈妈是广场舞的领舞，她妈妈一出现在广场，四十岁以上的男人就流口水。她们母女俩承包了周围所有男人的口水……',
'我今天抱着男票胳膊说“你夸我，夸我漂亮，我不管，我就要你夸我……”男票恨恨的说:你特么就是会跑的伟哥……',
'一次和男同学聊天，聊着聊着他说要去尿尿，我习惯性的给他两张厕纸，他说“你干嘛”，当时想都没想，说了句“你不是去厕所吗？”然后他说“我是男的”。当时我俩就尴尬了。。',
'现在的天气，早上可以玩雪，中午可以玩水，晚上可以和泥，如果心情好，半夜还可以出来滑冰！这一天天滴老嗨啦！穿貂出门一定要打伞！否则浇湿了！人家以为水耗子成精了[偷笑][偷笑]',
'小时候家里养了一只小狗，吃东西的时候一舔一舔的挺好玩，吃饭的时候我妈给我盛了一碗米饭，我也学着舔着吃，让我妈一巴掌拍桌子底下去了',
'说个真事我有个同学德国人 非常喜欢中国麻将 有一次她和我们一起玩 规则和我们有些不一样 她才知道麻将规则还分好多种。于是……她选择来中国留学 完成麻将大业……',
'一同事很有钱，总是在朋友圈晒一个角度显示家里装修很好很大，我们就开玩笑说去他家会迷路，第二天，一女的心情不好，发朋友圈说迷失了自我，我们都神回复:你去✘✘家玩了？',
'当年在老家时，每逢酒席，我都是那一桌的“酒司令”（陪酒及劝酒的）！直到有一次，同桌八人喝吐了五个，一个进了医院，就再也没人叫我当“酒司令”了！因为……进医院的那人就是我！',
'闺女把手伸到我面前，我就顺势亲了亲她的小手，然后她告诉我，让我看她扣的鼻屎。我……没事，这是亲闺女。',
'本人用的是爱疯5S，我女朋友用的是米3，以前都是她吵着跟我换手机用，现在换我求她换手机用！ 没办法！她的手机太强大了，无论那个宾馆都可以自动连wifi',
'今天回家，老公就往我嘴里塞面包，女儿也要吃，老公说：这个面包过期了，让你妈和我吃，我们看有毒吗？女儿说：我要吃，我要和你们一起死',
'以前总是听老师说她上一届的学生有多么乖，多么听话，终于，老师把我们这届快教完了，心里还期待着自己马上就会成为老师口中神奇的上一届学生，老师却告诉我们，我们这批教完了就退休……',
'小学三年级，班主任问我们长大了想干什么？班里科学家，诗人，音乐家各种高大上，只有我说:我想当修理工。然后被他们嘲笑了很多年。现在就我的梦想TM实现了！',
'以前我帮规划弟弟人生，我说你开女装店，以后姐姐天天有新衣服穿，去你店免费拿，又说叫他开鞋店，然后弟弟怒说以后开花圈店棺材店让你去免费拿。',
'买的熏鸡翅，有翅尖和翅中，女儿就说妈妈你吃胖鸡翅，（翅中是胖鸡翅）我吃瘦鸡翅，心里满满的感动，问女儿为什么呀?结果女儿说了一句，因为妈妈你胖呗',
'在网上买了一个记忆枕，本来以为会睡的很好，然而一晚上做的梦像盗梦空间里面一样一环扣着一环，心好累，早上起床的时候根本起不来，我是不是买了个假枕头？',
'就刚刚同事肠胃炎，陪他去打点滴！割了实习护士的……几个人换着扎都没扎准。同事就问：你们是在绣花嘛？  gc是旁边护士来句：不对，她们像在刺绣！！！扎针的护士笑喷了又扎错了……',
'这辈子干过最伟大的一件事，就是老表们在池塘里游泳，我把他们的衣服扔到池塘里去了，然后看着他们光着屁股回家！到现在说起来，我都觉得特带劲！',
'追了好久的女神告诉我，她有男朋友了，听完以后我兴奋的告诉她，喜欢你是我的事，再说了有守门员又怎样，有守门员球还不是照样进',
'今年我走的最错的一步，是我在冬腊月的时候丢了花光积蓄买来的秋衣秋裤。真正的寒冬在春天来了，我特么好无助。',
'我今天一不小心撕碎了一张100元大钞，后来赶紧去花。对方问我:“这100块钱怎么这样了？”我说是之前找我的。然后他就说:“那个人到底给了他多少钱能找你100块钱？”',
'偶然看到这个帖子，评论很多。想起云南那悲催哥们，微博各种爱国，各种打小日本捐命，生了三个女儿一个儿子，结果过年在家被计生办强行给阉了。',
'网聊一美女，见面开房后感觉哪里不对。问其原因美女答:其实跟你聊的是我妈！顿时菊花一紧。美女接着说了句：这有什么？我不想我妈找小白脸！我上过的，我妈从来不上！',
'室友和别人打电话，她说:吃不胖的十七岁，仙女般的小吃货。我情不自禁的觉得这句话应该是:吃不胖的十七岁，仙女般的小智障！！！！',
'记得那年冬天特别冷，出去逛街刮了好大的风，本人喜欢穿高跟鞋，平时走路又是高冷范儿，从不看地上，结果莫名其妙摔了个大马趴，顾不上疼，四处先看一下有没有人，糗死了',
'记得在街上看到两个人在下象棋。一个小年轻下不赢了。用炮走拐弯路把对方車吃了。然后对方发火了。你大爷的炮还能走拐弯路啊。拿起砖头打在小年轻头上。',
'昨天发了个朋友圈，说我要去报个健身课程减肥。立刻就有损友留言： 你肥，不要紧，永远不要放弃努力，相信自己，只要坚持锻炼，就一定会变成一个健康的胖子。。。',
'本人从事不孕不育工作的，今天上班一女同事跟我说，哥你再生一个呗，你老婆要是不同意，我给你捐卵……我……今天一直考虑这二货说话负责吗',
'今天一个女的在试衣间大外套，她对朋友说，算了，这件衣服我撑不起来。她朋友说 ，得了吧，你哪件衣服撑不起来啊？每件衣服都撑满了。',
'食堂阿姨：你做菜不好吃我忍了！你啰哩啰嗦我也忍了！你洗碗不干净我都忍了 ！！但你每天穿个双胞胎乳猪料的衣服在厨房进进出出，做饭炒菜，是几个意思 。。。。。',
'本人女！一次换衣服被我家二岁多的小逗比看见了，他说我吃过麻麻的奶奶我说你还记得啊他说呀现在不吃了，归爸爸吃了这孩子是不是知道的太多了',
'前几天跟老公在床上玩手机的时候逗了几句嘴，他说不过我，突然就说要离家出走，然后只见他从床上坐了起来之后趴到了床尾……',
'在地铁里用手挡住打了个喷嚏，结果一手的鼻涕口水，关键我还没有纸巾！然后就尴尬的握着拳头！明细感觉到左右两边的人往外移了移！唉',
'和老公开车回娘家，在服务区休息，那货去厕所上了个大号，顺便抽烟。回车上的第一句话就是：有东西吃吗？嘴里有味。我：你是吃屎了么？那货摇头说我没救了',
'妈妈说我上幼儿园学校在村西头，妈妈这边走我就在后面跟着回家，然后送回学校去， 他走大路我就走小路回去  再送回去，就这样来回，最后没办法让姑姑在学校门口蹲着看我还偷跑回去吗',
'刚才跟男盆友一起去动物园，他的呢大衣上沾满了毛毛，然后我就说你看你身上，这货说了一句:啊！我今天出门前忘了刮毛。哈哈，笑了一路',
'四小伙在一起吃饭，结束的时候一小伙说：“咱们谁长的丑，谁结账呗！” 这时一服务员转头问：“是要AA制吗？',
'一个姑娘在你一无所有的时候愿意陪你，有一天她离开了，肯定不是因为你没钱，而是因为攒够了失望，因为你对她的不珍惜。',
'昨晚起夜，回来打算给她盖盖被子，老婆有踢被子的习惯。。。当我盖被子的时候发现，老婆翘着二郎腿在睡觉。。还打着响亮的咕噜。。那一刻我觉得老婆真爷们。。就差一巴掌护心毛了。。。',
'前段时间，有一篇爆文风靡朋友圈，大意是，爱她就要给她买买买，都不给她花钱，你还好意思说爱她？在文章底下，有一条评论，让我忍俊不禁：“哎，分手一年了，我现在还没还完分期付的钱。”',
'今天和姨夫聊天，他说自己哥四个，然后他叫王雨，他二弟叫王风，他三弟叫王城，还没等他说，我就说‘你四弟是不是叫王满’，他问‘为啥啊’，我说 满城风雨嘛，然后差点被我姨夫打死……',
'“你知道人民币上画的那个人是谁吗？”　　“不知道。”　　“那是我滴大媒人，和女朋友谈恋爱全靠他了。”',
'今天接了一个水泡型脚气的病人，突然想到以前在医学院上学时，我买了鸡爪在啃，问舍长要不要吃，他说，不要，万一鸡有脚气呢？！！尼玛，一句话怼的我，两年没再吃鸡爪了……',
'胃疼和脊椎病同时犯了躺床上歇着胃一疼我就弓腰，然后一会脊椎就疼的受不了了，再把腰挺直了。舍友看到了，问我：你在日被子吗？我：……',
'今天去面试“你的简历上怎么有个洞？”“我坐过牢。”“为什么？”“上次面试的时候那人叫我回去等通知。”“明白了，你被录取了！”',
'今天看到一个小孩在和几个小孩分享东西吃，突然回想到楼主当年小得时候，也是分零食给朋友吃，但我死死的捏住口子，嘴里依然说着，吃嘛，快拿啊，不要客气。。。哈哈哈哈，有木有同感。',
'今天坐动车时候检票，广播说到蓝色的票请往哪里走，红色的又去哪里人工检票，然后一个大叔好着急的说，我的车票怎么是黑色的',
'我一哥们和他女朋友一起半年了，有一天发现那妞竟然和他弟弟在一起，他就把他弟弟叫出来让解释下。他弟弟满脸堆笑:“不好意思哥，不是兄弟太无情，是嫂子太迷人”！我哥们竟无言以对',
'有一次和老乡一起逛内衣店，店里过道比较窄，看完没合适的就出来了，刚走出门没几步老乡一把抱住我，笑的眼泪出来了都，我说你他妈有病啊，只见老乡从外套帽子上拿下一条内裤',
'老婆居然说我懒得跟个蛆一样。还好我机智，当时就怼回去了:"你也不是什么好屎，我都懒得拱你"。怼完心情好多了。。。。。',
'昨晚在寝室，和同学偷偷聊天，图个方便，我就把头伸进了床尾的栏杆里，伸进去本来就不容易，我和同学也只不过才聊到一点多，再后来，我的头就卡在里面了，难道是我头太大？'}